---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchVoltageLineToLine
source: html/04d6c173-8ab7-dab8-78a8-cd6fc28303f8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchVoltageLineToLine Property

Cannot assign or add [Element] to Circuit. The Voltage ([Voltage Value]) for the Circuit is out of range for the Line to Line Voltage for [Element] (The Line to Line Voltage is specified in the assigned Distribution System).

## Syntax (C#)
```csharp
public static FailureDefinitionId MismatchVoltageLineToLine { get; }
```